clear;
h = 6e-9; % 阱宽
H = 12e-9; % 垒宽

length = 0.01e-9; %向量间隔

%bx = 0.82;
%by = 0.38;
%wx = 0.53;
%wy = 1;

bx = 1; % InGaAsP  ——> x,1-x,y,1-y
by = 0;
wx = 0.53;
wy = 1;

N = 1; % 量子阱数目
offset = 0.6;
z = (-N*(H+h)/2):length:(N*(H+h)/2); % 定义域
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
k = 0.25;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
CIn0 = composition(length,h,H,bx,wx,N,1e-15);
CIn1 = composition(length,h,H,bx,wx,N,0.5e-9);
CIn2 = composition(length,h,H,bx,wx,N,1e-9);
CIn3 = composition(length,h,H,bx,wx,N,2e-9);

CAs0 = composition(length,h,H,by,wy,N,k*1e-14);
CAs1 = composition(length,h,H,by,wy,N,k*0.5e-9);
CAs2 = composition(length,h,H,by,wy,N,k*1e-9);
CAs3 = composition(length,h,H,by,wy,N,k*2e-9);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%plot(z,CIn0,z,CAs0,z,CIn1,z,CAs1,z,CIn2,z,CAs2,z,CIn3,z,CAs3);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
E0 = offset*potential(CIn0,CAs0);
E1 = offset*potential(CIn1,CAs1);
E2 = offset*potential(CIn2,CAs2);
E3 = offset*potential(CIn3,CAs3);

%E0 = E0 - E0(1,N*(H+h)/2/length); %阱数目为偶数的时候需要修正！！！ --> 取消置底！！
%E1 = E1 - E1(1,N*(H+h)/2/length);
%E2 = E2 - E2(1,N*(H+h)/2/length);
%E3 = E3 - E3(1,N*(H+h)/2/length);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%plot(z,E0,z,E1,z,E2,z,E3);
%plot(z,E2);
%hold on;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
str0 = strain(CIn0,CAs0);
str1 = strain(CIn1,CAs1);
str2 = strain(CIn2,CAs2);
str3 = strain(CIn3,CAs3);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%plot(z,str2);
%plot(z,str0,z,str1,z,str2,z,str3);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
Vc0 = Vc(CIn0,CAs0,offset);
Vc1 = Vc(CIn1,CAs1,offset);
Vc2 = Vc(CIn2,CAs2,offset);
Vc3 = Vc(CIn3,CAs3,offset);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
x = CIn2;
y = CAs2;
Eg = 1.35 - 1.17*y + 0.668*(1-x) - 0.069*y.*(1-x) + 0.18*y.^2 + 0.03*(1-x).*y.^2 + 0.758*(1-x).^2 - 0.322*y.*(1-x).^2; %InGaAsP
Eg = 1.6e-19 * Eg;

%%%%%%%%%%
c_11 = 11.8*(1-x).*y + 8.329*x.*y + 14.12*(1-x).*(1-y) + 10.22*x.*(1-y);
c_11 = 1e11 * c_11 * 1e-3;

c_12 = 5.38*(1-x).*y + 4.526*x.*y + 6.253*(1-x).*(1-y) + 5.76*x.*(1-y);
c_12 = 1e12 * c_12 * 1e-3;

dEgdp = 11.5*(1-x).*y + 10.0*x.*y + 11.0*(1-x).*(1-y) + 8.5*x.*(1-y);
dEgdp = 1e-6 * 1.6*1e-19 * 1e-5 * dEgdp;

av = -1/3 * (   c_11  +  2*c_12  ) .* dEgdp;

s_1 = -2*av.* (   1  -  c_12  /  c_11  )   .*  strain(x,y);
%%%%%%%%%%%

Vc2 = offset*Eg - (1-offset)*s_1;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%plot(z,Vc2);
plot(z,E2,z,offset*Eg)
%plot(z,E2,z,(1-offset)*s_1,z,E2-(1-offset)*s_1);
%plot(z,Vc0,z,Vc1,z,Vc2,z,Vc3);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%